app/Livewire/Account/Dashboard.php

select count(*) as aggregate from "shopifystores" where "user_id" = 8
---
    public function render()
    {

        if (!(currentTeam()->Subscribed('default') || currentTeam()->onTrial())) {
            $this->redirect('/plans');
        }

        $user_id = Auth::user()->id;
        $storelimit = check_store_limit();
        // get user's stores
        // $totalstores = Storeuser::where('user_id', $user_id)->pluck('store_id');

        // $stores = Shopifystores::where('user_id', '=', $user_id)->get();
        $stores = Shopifystores::where('user_id', $user_id)
                                    //   ->where('status', 'active')
                                      ->get();
        $totalstores = Shopifystores::where('user_id', $user_id)->count();